Revit 2027 API
RebarConstrainedHandle.HandleBehavior Property
 Identifies the handle behavior.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarHandleBehavior HandleBehavior { get; set; }
Public Property HandleBehavior As RebarHandleBehavior
	Get
	Set
public:
property RebarHandleBehavior HandleBehavior {
	RebarHandleBehavior get ();
	void set (RebarHandleBehavior value);
}
member HandleBehavior : RebarHandleBehavior with get, set
Property Value
RebarHandleBehavior
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The input behavior is not applicable for the current RebarConstrainedHandle.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace